Revit 2027 API
AnnotationMultipleAlignmentUtils.MoveWithAnchoredLeaders Method
 Moves the element while keeping the leader end points anchored.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void MoveWithAnchoredLeaders(
	Element element,
	XYZ moveVec
)
Public Shared Sub MoveWithAnchoredLeaders (
	element As Element,
	moveVec As XYZ
)
public:
static void MoveWithAnchoredLeaders(
	Element^ element,
	XYZ^ moveVec
)
static member MoveWithAnchoredLeaders :
        element : Element *
        moveVec : XYZ -> unit
Parameters
element Element
 The element to be moved.
moveVec XYZ
 The move vector for translating the element.
Exceptions
Exception | Condition
ArgumentException |  The element element does not support multiple alignment behavior.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Failed to move element.
See Also
Reference
AnnotationMultipleAlignmentUtils Class
Autodesk.Revit.DB Namespace